x3ro/tinyos-legacy/tinyos-1.x/contrib/ucb/tools/jtag-usb/jtag/MSP430mspgcc.c
//  $Id: MSP430mspgcc.c,v 1.1 2004/12/03 23:55:11 szewczyk Exp $
/* "Copyright (c) 2000-2004 The Regents of the University of California.  
 * All rights reserved.
 *
 * Permission to use, copy, modify, and distribute this software and its
 * documentation for any purpose, without fee, and without written agreement
 * is hereby granted, provided that the above copyright notice, the following
 * two paragraphs and the author appear in all copies of this software.
 * 
 * IN NO EVENT SHALL THE UNIVERSITY OF CALIFORNIA BE LIABLE TO ANY PARTY FOR
 * DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT
 * OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE UNIVERSITY
 * OF CALIFORNIA HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 * THE UNIVERSITY OF CALIFORNIA SPECIFICALLY DISCLAIMS ANY WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
 * ON AN "AS IS" BASIS, AND THE UNIVERSITY OF CALIFORNIA HAS NO OBLIGATION TO
 * PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS."
 */


/*
  @author Robert Szewczyk <szewczyk@eecs.berkeley.edu>
  added a few minor tweaks to interface witht he Telos revB USB library.  
  modified the Memory Read to use MemReadQuick to avoid latency for every byte
  added calls to HIL_Resync and HIL_Flush as appropriate

  @author Chris Liechti <cliechti@gmx.net>
 
  Please see LICENSE.txt in the current directory.  
  
*/
// MSP430 DLL.
//
// This file contains the DLL functions.

// #includes. -----------------------------------------------------------------

#include <stdlib.h>
#include <string.h>

#include "defs.h"
#include "HIL.h"
#include "MSP430mspgcc.h"
#include "JTAGfunc.h"
#include "funclets.h"

// #defines. ------------------------------------------------------------------

#define DLL_VERSION         03      // DLL version * 10.

// (File) Global variables. ---------------------------------------------------
static BOOL jtagReleased = FALSE;
unsigned int debug_level = 0;

static const char* errorStrings[] = {
    "No error",
    "Could not initialize device interface",
    "Could not close device interface",
    "Invalid parameter(s)",
    "Could not find device (or device not supported)",
    "Unknown device",
    "Could not read device memory",
    "Could not write device memory",
    "Could not set device Vcc",
    "Could not reset device",
    "Could not set device operating frequency",
    "Could not erase device memory",
    "Could not run device",
    "Verification error",
    "Invalid error number",
};

// Global variables. ----------------------------------------------------------

int errorNumber = NO_ERR;       // Error number.
BOOL executeVerify = FALSE;     // Verify the stub code downloaded by executeCode().

// Functions. -----------------------------------------------------------------

/* ----------------------------------------------------------------------------
Initialize the interface.

Parameters:
 port:    Interface port reference (application specific).
 version: The version number of the MSP430 DLL is returned.

Returns:
 STATUS_OK:    The interface was initialized.
 STATUS_ERROR: The interface was not initialized.

Error codes:
 INITIALIZE_ERR

Notes:
 1. *** This function must be called first. ***
*/
STATUS_T WINAPI MSP430_Initialize(CHAR const * port, LONG* version) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_Initialize...\n");
    if (version) {
        *version = DLL_VERSION;
    }

    if (HIL_Initialize(port) != STATUS_OK) {
        RET_ERR(INITIALIZE_ERR);
    }
    // Just to be on the safe side, make sure the commands are flushed to the
    // device, and the queues are reinitialized
    HIL_Resync();
    HIL_Flush();
    RET_OK;
}

/* ----------------------------------------------------------------------------
Close the interface.

Parameters:
 vccOff: Turn off the device Vcc (0 volts) if TRUE.

Returns:
 STATUS_OK:    The interface was closed.
 STATUS_ERROR: The interface was not closed.

Error codes:
 CLOSE_ERR

Notes:
 1. If called, this function must be called last.
 2. This function calls user-supplied function: HIL_Close()
*/
STATUS_T WINAPI MSP430_Close(LONG vccOff) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_Close...\n");
    if (HIL_Close(vccOff) != STATUS_OK) {
        RET_ERR(CLOSE_ERR);
    }
    RET_OK;
}

/* ----------------------------------------------------------------------------
Configure the mode(s) of the device and/or the software.
currently supported options:
    VERIFICATION_MODE: enable verify of data downloaded into the device FLASH.

Parameters:
 mode:     The mode to be configured.
 value:    The mode value.

Returns:
 STATUS_OK:    The mode was configured.
 STATUS_ERROR: The mode was not configured.

Error codes:
 PARAMETER_ERR
*/
STATUS_T WINAPI MSP430_Configure(LONG mode, LONG value) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_Configure(0x%x, 0x%x)\n", mode, value);
    switch (mode) {
        case VERIFICATION_MODE:
            executeVerify = (BOOL) value;
            break;
        case RAMSIZE_OPTION:
            ramsize = value;
            MSP430_Log(1, "MSP430mspgcc: Changing RAMSIZE to %d\n", ramsize);
            break;
        case DEBUG_OPTION:
            debug_level = value;
            MSP430_Log(1, "MSP430mspgcc: Debug level set to %d\n", value);
            break;
        case FLASH_CALLBACK:
            flash_callback = (void *)value;
            MSP430_Log(1, "MSP430mspgcc: Set Flash progress Callback\n");
            break;
        default:
            RET_ERR(PARAMETER_ERR);
            //~ break;
    }
    RET_OK;
}

/* ----------------------------------------------------------------------------
Set the device Vcc pin to voltage/1000 volts.
A "voltage" of zero (0) turns off voltage to the device.
!! The FET interface does not support setting the voltage.
!! for nonzero values the power on the FET kits is enabled,
!! disables otherwise.

