x3ro/tinyos-legacy/tinyos-1.x/contrib/ucb/tools/jtag-usb/jtag/MSP430mspgcc.c
!! For Telos over USB, this function has no meaning.  

Parameters:
 voltage: The device Vcc pin is set to voltage/1000 volts.

Returns:
 STATUS_OK:    The Vcc was set
 STATUS_ERROR: The Vcc was not set

Error codes:
 PARAMETER_ERR
 VCC_ERR
*/
STATUS_T WINAPI MSP430_VCC(LONG voltage) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_VCC...\n");
#define MAX_VCC_Limit 3600
    if ((voltage < 0) || (voltage > MAX_VCC_Limit)) {
        RET_ERR(PARAMETER_ERR);
    }

    if (HIL_VCC(voltage) != STATUS_OK) {
        RET_ERR(VCC_ERR);
    }
    RET_OK;
}

/* ----------------------------------------------------------------------------
Initialize JTAG and reset device. This function has to be called before any other
function acessing the device can work.

Returns:
 STATUS_OK:    JTAG is connected and the device was reset.
 STATUS_ERROR: No connection or device not found.

Error codes:
 NO_DEVICE_ERR
 RESET_ERR
*/
STATUS_T WINAPI MSP430_Open(void) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_Open...\n");
    if (HIL_Open() == STATUS_OK) {      // Enable the JTAG interface to the device.
        return MSP430_Reset(RST_RESET|VCC_RESET, FALSE, FALSE); //needs a reset method with GetDevice
    } else {
        RET_ERR(NO_DEVICE_ERR);
    }
}


/* ----------------------------------------------------------------------------
Reset the device using the specified method(s). Optionally start device execution,
and release the JTAG control signals.

Parameters:
 method:      The bit mask specifying the method(s) to use to reset the device:
                PUC:     The device is reset using PUC (i.e., a "soft" reset).
                RST_NMI: The device is reset using the RST/NMI pin (i.e., a "hard" reset).
                VCC:     The device is reset by cycling power to the device.
 execute:     Start device execution (when TRUE).
 releaseJTAG: Release the JTAG control signals (when TRUE). execute must be TRUE.

Returns:
 STATUS_OK:    The device was reset (and optionally started [and JTAG control released])
 STATUS_ERROR: The device was not reset (and optionally started [and JTAG control released]).

Error codes:
 PARAMETER_ERR
 RESET_ERR
 RUN_ERR

Notes:
 1. It is possible to combine reset methods. The methods are applied in the following order:
    PUC then RST_NMI then VCC. If a reset operation fails, the next reset method (if any) is applied.
 2. Following reset by RST/NMI and/or VCC, a PUC is automatically executed to reset the device in
    such a way that it does not begin to execute a resident program (or garbage).
*/
STATUS_T WINAPI MSP430_Reset(LONG method, LONG execute, LONG releaseJTAG) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_Reset...\n");
    if (!method) {
        RET_ERR(PARAMETER_ERR);
    }

    //~ // Force a frequency set after reset.
    //~ eraseFrequencySet = programFrequencySet = FALSE;

    if (method & PUC_RESET) {                           //1st try: a PUC over JTAG
        ReleaseDevice(V_RESET);
        if (releaseJTAG) {
            if (HIL_Release() != STATUS_OK) {   // Release the JTAG control signals.
                MSP430_Log(2, "MSP430mspgcc: PUC_RESET but JTAG release FAILED\n");
                RET_ERR(RUN_ERR);
            }
	    HIL_Resync();
	    HIL_Flush();
            jtagReleased = TRUE;
            MSP430_Log(2, "MSP430mspgcc: PUC_RESET and JTAG release ok\n");
            RET_OK;
        } else {
            // Connect and synchronize with the CPU. The CPU is clocked with TCLK. Read/Write will be set.
            if (GetDevice() == STATUS_OK) {
                if (execute) {                              // should the application run?
                    HIL_JTAG_IR(IR_CNTRL_SIG_RELEASE);      // Start device
							    // execution (and
							    // 
							    // retain JTAG control signals).
		    HIL_Resync();
		    HIL_Flush();
                }
                MSP430_Log(2, "MSP430mspgcc: PUC_RESET ok\n");
                RET_OK;
            }
        }
        //just try next reset method if this one did not succeed
        
        //~ if (ExecutePUC() == STATUS_OK) {
            //~ if (syncCPU() == STATUS_OK) {
                //~ if (execute) {                          // should the application run?
                    //~ HIL_JTAG_IR(IR_CNTRL_SIG_RELEASE);  // Start device execution (and retain JTAG control signals).
                    //~ if (releaseJTAG) {                  // disconnect JTAG?
                        //~ if (HIL_Release() != STATUS_OK) {// Release the JTAG control signals.
                            //~ RET_ERR(RUN_ERR);
                        //~ }
                        //~ jtagReleased = TRUE;
                    //~ }
                //~ }
                //~ MSP430_Log(2, "MSP430mspgcc: PUC_RESET ok\n");
                //~ RET_OK;
            //~ }
        //~ }
    }
    if (method & RST_RESET) {                           //if first method failed, try hard reset
        // Assert (hard) ~RST/NMI.
        HIL_RST(0);
	HIL_Resync();
	HIL_Flush();
        HIL_DelayMSec(50);                              // keep it low for some time (discharge caps)
        HIL_RST(1);                                     // adds an other delay ater the pin is high

	HIL_Resync();
	HIL_Flush();
        if (releaseJTAG) {
            if (HIL_Release() != STATUS_OK) {   // Release the JTAG control signals.
                MSP430_Log(2, "MSP430mspgcc: RST_RESET but JTAG release FAILED\n");
                RET_ERR(RUN_ERR);
            }
            jtagReleased = TRUE;

	    HIL_Resync();
	    HIL_Flush();
            MSP430_Log(2, "MSP430mspgcc: RST_RESET and JTAG release ok\n");
            RET_OK;
        } else {
            // Connect and synchronize with the CPU. The CPU is clocked with TCLK. Read/Write will be set.
            if (GetDevice() == STATUS_OK) {
                if (execute) {                              // should the application run?
                    HIL_JTAG_IR(IR_CNTRL_SIG_RELEASE);      // Start device execution (and retain JTAG control signals).
                }
                MSP430_Log(2, "MSP430mspgcc: RST_RESET ok\n");

		HIL_Resync();
		HIL_Flush();
                RET_OK;
            }
        }
    }
    if (method & VCC_RESET) {
	MSP430_Log(0,"This reset method is unsupported (Reset VCC)"); 
    }

    RET_ERR(RESET_ERR);
}

/* ----------------------------------------------------------------------------
Erase the device FLASH memory. MSP430_Read_Memory() can be used to search the
address of a failed erase operation.
If address+length extends beyond the segment containing address, intermediate
segments are erased (and checked).

Parameters:
 type: ERASE_SEGMENT: Erase the segment containing 'address'.
       ERASE_MAIN:    Erase the Main memory.
       ERASE_ALL:     Erase the Main and Information memories.
 address:             Starting address of erase check operation. Must be word aligned.
 length:              Length of erase check operation (even number of bytes).

Returns:
 STATUS_OK:    The device FLASH memory was erased.
 STATUS_ERROR: The device FLASH memory was not erased.

