x3ro/tinyos-legacy/tinyos-1.x/contrib/ucb/tools/jtag-usb/jtag/MSP430mspgcc.c
Error codes:
 PARAMETER_ERR
 ERASE_ERR
*/
STATUS_T WINAPI MSP430_Erase(LONG type, LONG address, LONG length) {
    STATUS_T result = STATUS_OK;
    MSP430_Log(1, "MSP430mspgcc: MSP430_Erase...\n");
    
    if (((type != ERASE_SEGMENT) && (type != ERASE_MAIN) && (type != ERASE_ALL)) ||
           (address < 0) || (address + length > FLASH_END_ADDR + 1)) {
        RET_ERR(PARAMETER_ERR);
    }

    switch (type) {
        case ERASE_SEGMENT:
        {
            LONG segmentAddr;
            WORD segmentSize;
            // Erase each of the segments.
            for (segmentAddr = address; segmentAddr < (address + length); segmentAddr += segmentSize) {
                if ((result = eraseFlash(ERASE_SEGMENT, (WORD) segmentAddr)) != STATUS_OK) {
                    break;
                }
            
                // The segment size is dependent upon the adress.
                if (segmentAddr < 0x1100) {
                    segmentSize = INFO_SEGMENT_SIZE;            // Information memory.
                } else if (segmentAddr < 0x1200) {
                    segmentSize = FIRST_60K_SEGMENT_SIZE;       // The first segment of 60K devices is short.
                } else {
                    segmentSize = MAIN_SEGMENT_SIZE;            // Main memory.
                }
            }
            if (result != STATUS_ERROR) {
                //check the entire length for erasure.
                result = VerifyPSA(address, length/2, 0);
            }
            break; // ERASE_SEGMENT.
        }
        case ERASE_MAIN:
        case ERASE_ALL:
            result = eraseFlash((WORD) type, (WORD) address);
            break;
        default:
            result = STATUS_ERROR;
            break;
    }

    if (result != STATUS_OK) {
        RET_ERR(ERASE_ERR);
    }

    RET_OK;
}

/* ----------------------------------------------------------------------------
Read and write the device memory. "Device memory" includes the Special Function
Registers (i.e., peripheral registers), RAM, Information (FLASH) memory, and
Main (FLASH) memory.
The write to FLASH memory operation DOES NOT erase the FLASH, use MSP430_Erase
in advance to do so.

Parameters:
 address: The starting address of the device memory to be read or written.
 buffer:  The buffer into which device memory is read, or from which device memory is written.
 count:   The number of bytes of device memory read or written.
 rw:      Specify a read (READ) or write (WRITE) operation.

Returns:
 STATUS_OK:    The memory operation encountered no errors.
 STATUS_ERROR: The memory operation encountered errors.

Error codes:
 PARAMETER_ERR
 READ_MEMORY_ERR
 WRITE_MEMORY_ERR
*/

//TODO: transition this back to the ReadMemoryQuick and WriteMemoryQuick. 
STATUS_T WINAPI MSP430_Memory(LONG address, CHAR* buffer, LONG count, LONG rw) {
    WORD doneCount = 0;
    WORD memValue;
    BOOL adjustLast = FALSE;
    WORD i;
    if (rw) {   //read
        MSP430_Log(1, "MSP430mspgcc: MSP430_MemoryRead...\n");
        if (address < WORD_REG_START_ADDR) {    // Process all byte addresses first.
            doneCount = WORD_REG_START_ADDR - (WORD) address;
            if (count < doneCount) {
                doneCount = (WORD) count;
            }
            for (i=0; i<doneCount; i++) {
                buffer[i] = ReadMem(F_BYTE, (WORD)(address + i));
            }
        } else if (address & 1) {               // Otherwise force word alignment if not.
            memValue = ReadMem(F_WORD, (WORD)(address + count));
            *buffer = (memValue >> 8) & 0xFF;
            doneCount = 1;
        }
        // And now the word memory.   
        if ((count - doneCount) > 0) {
            if ((address + count) & 1) {        // The last address has to be aligned.
                adjustLast = TRUE;
                count--;
            }
	    //RS: ReadMemQuick is much faster over the USB, because we do not
	    //incur USB latency on every word.  As a result, I believe that is
	    //actually may be more reliable than the read every word approach
	    //appropriate for for FET 
            ReadMemQuick((WORD) (address + doneCount),
                         (WORD) ((count - doneCount) / 2),
                         (WORD*) (buffer + doneCount)
             );
#if 0
            //slow but reliable upload, instead of ReadMemQuick
            //but this is 3 times or so slower....
            for (i=0; i<(count - doneCount)/2; i++) {
                ((WORD*)(&buffer[doneCount]))[i] = ReadMem(F_WORD, (WORD)(address + doneCount + i*2));
            }
#endif
            if (adjustLast) {
                memValue = ReadMem(F_WORD, (WORD)(address + count));
                *(buffer + count) = memValue & 0xFF;
            }
        }
    } else {    //write
        MSP430_Log(1, "MSP430mspgcc: MSP430_MemoryWrite...\n");
        if (address < WORD_REG_START_ADDR) {    // Process all byte addresses first.
            doneCount = WORD_REG_START_ADDR - (WORD) address;
            if (count < doneCount)
                doneCount = (WORD) count;
            for (i=0; i<doneCount; i++) {
                WriteMem(F_BYTE, (WORD)(address + i), buffer[i]);
            }
        } else if (address & 1) {               // Otherwise force word alignment if not.
            memValue = 0x00FF | ((*buffer) << 8);
            WriteMem(F_WORD, (WORD)(address + count), memValue);
            doneCount = 1;
        }
        // And now the word memory.   
        if (address < FLASH_START_ADDR) {       // Write in io/ram.
            if ((count - doneCount) > 0) {
                if ((address + count) & 1) {    // The last address has to be aligned.
                    adjustLast = TRUE;
                    count--;
                }
                WriteMemQuick((WORD) (address + doneCount),
                             (WORD) ((count - doneCount) / 2),
                             (WORD*) (buffer + doneCount)
                );
                if (adjustLast) {
                    memValue = *(buffer + count) | 0xFF00;
                    WriteMem(F_WORD, (WORD) (address + count), memValue);
                }
            }
        } else {                                // Write in flash
            if ((address >= FLASH_START_ADDR) && ((address + count - 1) <= FLASH_END_ADDR)) { // Write in flash.
                CHAR* prgBuffer = buffer;
                BOOL mallocedBuffer = FALSE;
                STATUS_T result;
                
                // The flash only supports writing words on word boundaries. Force alignment
                // if odd address and/or odd count.
                // Even address and odd length: pad last, count + 1.
                if (!(address & 1) && (count & 1)) {
                    prgBuffer = malloc(count + 1); mallocedBuffer = TRUE;
                    memcpy(prgBuffer, buffer, count);
                    prgBuffer[count++] = (CHAR)0xff;
                } else if ((address & 1) && !(count & 1)) {
                    // Odd address and even length: pad first and last, count + 2, address--.
                    prgBuffer = malloc(count + 2); mallocedBuffer = TRUE;
                    memcpy(prgBuffer + 1, buffer, count++);
                    prgBuffer[0] = prgBuffer[count++ + 1] = (CHAR)0xff;
                    address--;
                } else if ((address & 1) && (count & 1)) {
                    // Odd address and odd length: pad first, count + 1, address--.
                    prgBuffer = malloc(count + 1); mallocedBuffer = TRUE;
                    memcpy(prgBuffer + 1, buffer, count++);
                    prgBuffer[0] = (CHAR)0xff;
                    address--;
                }
                
                // Program the flash (assuming that it is erased).
                result = programFlash((WORD)address, prgBuffer, (WORD)count);
                
                if (mallocedBuffer) {
                    free(prgBuffer);
                    mallocedBuffer = FALSE;
                }
                if (result != STATUS_OK) {
                    RET_ERR(WRITE_MEMORY_ERR);
                }
            } else {    // Write in flash.
                RET_ERR(WRITE_MEMORY_ERR); // Write starts and/or ends outside of valid memory.
            }
        }
    }
    RET_OK;
}

/* ----------------------------------------------------------------------------
Read Register.

Parameter:
 RegNum:      Register number 0-15.
 Value:       [OUT] the 16 bit value of the register.

Returns:
 STATUS_OK:    Success.
 STATUS_ERROR: Failure, Register num out of range.

