x3ro/tinyos-legacy/tinyos-1.x/contrib/ucb/tools/jtag-usb/jtag/MSP430mspgcc.c
Error codes:
 PARAMETER_ERR
*/
STATUS_T WINAPI MSP430_ReadRegister(LONG RegNum, LONG *Value) {
    WORD temp;
    MSP430_Log(1, "MSP430mspgcc: MSP430_ReadRegsiter...\n");
    if (GetReg(RegNum, &temp) != STATUS_OK) {
        RET_ERR(PARAMETER_ERR);
    }
    *Value = temp & 0xffff;
    RET_OK;
}

/* ----------------------------------------------------------------------------
Write Register.

Parameter:
 RegNum:      Register number 0-15.
 Value:       The 16 bit value to be written to the register.

Returns:
 STATUS_OK:    Success.
 STATUS_ERROR: Failure, Register num out of range.

Error codes:
 PARAMETER_ERR
*/
STATUS_T WINAPI MSP430_WriteRegister(LONG RegNum, LONG Value) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_ReadRegsiter...\n");
    if (SetReg(RegNum, Value) != STATUS_OK) {
        RET_ERR(PARAMETER_ERR);
    }
    RET_OK;
}

/* ----------------------------------------------------------------------------
Compare the MSP430 memory and the specified data. This function computes a
checksum for the specified memory region, and then computes a checksum for the
data, and finally compares the two checksums.

Parameter:
 StartAddr:    Start address of memory to be compared (must be even).
 Length:       Number of bytes to be compared (must be even).
 *DataArray:   Pointer to data array.

Returns:
 STATUS_OK:    The device memory and data compare.
 STATUS_ERROR: The device memory and data do not compare.

Error codes:
 PARAMETER_ERR
 VERIFY_ERR
*/
STATUS_T WINAPI MSP430_VerifyMem(LONG StartAddr, LONG Length, CHAR *DataArray) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_VerifyMem...\n");
    return (VerifyPSA(StartAddr, Length/2, (WORD *)&DataArray[0]));
}

/* ----------------------------------------------------------------------------
Verify that the specified memory range is erased. MSP430_VerifyMem is
used to check the memory.

Parameter:
 StartAddr:    Start address of memory to be verified (must be even).
 Length:       Number of BYTEs to be verified (must be even).

Returns:
 STATUS_OK:    The device memory in the specified range is erased.
 STATUS_ERROR: The device memory in the specified range is not erased.

Error codes:
 PARAMETER_ERR
 VERIFY_ERR
*/
STATUS_T WINAPI MSP430_EraseCheck(LONG StartAddr, LONG Length) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_EraseCheck...\n");
    return (VerifyPSA(StartAddr, Length/2, 0));
}

// Error handling functions ---------------------------------------------------

/* ----------------------------------------------------------------------------
Determine the number of the error when an MSP430_xxx() function returns STATUS_ERROR.
The error number is reset (to NO_ERR) after the error number is returned.

Returns:
 The number of the last error.
*/
LONG WINAPI MSP430_Error_Number(void) {
    int tempErrorNumber = errorNumber;
    MSP430_Log(1, "MSP430mspgcc: MSP430_Error_Number...\n");
    errorNumber = NO_ERR;
    return (tempErrorNumber);
}

/* ----------------------------------------------------------------------------
Determine the string associated with errorNumber.

Parameter:
 errorNumber: Error number.

Returns:
 The string associated with errorNumber.
*/
const CHAR* WINAPI MSP430_Error_String(LONG errorNumber) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_Error_String...\n");
    if ((errorNumber < 0) || (errorNumber >= INVALID_ERR)) {
        errorNumber = INVALID_ERR;
    }
    return (errorStrings[errorNumber]);
}

/* ----------------------------------------------------------------------------
Execute the 'funclet' provided in code.

A funclet has the download address, start of main address and the end address as the
first 6 bytes. Between these 3 words and the starting address a range of memory
can be used to pass data to the funclet.
*/
STATUS_T WINAPI MSP430_Funclet(CHAR* code, LONG sizeCode, BOOL verify, BOOL wait) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_Funclet...\n");
    return executeCode((WORD *)code, sizeCode/sizeof(WORD), verify, wait);
}

/* ----------------------------------------------------------------------------
Check if the CPU is stuck on an address. This can be because it's executing a
"jmp $" or it's in the lowpower mode. Use at your own risk, may not work in any
case!?
*/
int WINAPI MSP430_isHalted(void) {
    MSP430_Log(1, "MSP430mspgcc: MSP430_isHalted...\n");
    return isHalted();
}

/* ----------------------------------------------------------------------------
Output debug messages

There messages are dumped if they are smaller than the given debug level.
The level can be set at runtime.
*/
STATUS_T WINAPI MSP430_Log(unsigned int level, const char *format, ...) {
    if (debug_level > level) {
        va_list args;
        va_start(args, format);
        vfprintf(stderr, format, args);
        va_end(args);
    }
    return STATUS_OK;
}
